optimize doc
